
    <!doctype html>

    <html>
    <head>
      <meta name="viewport" content="width=device-width, minimum-scale=1.0, initial-scale=1.0, user-scalable=yes">
      <meta name="theme-color" content="#4F7DC9">
      <meta charset="UTF-8">
      <title>open-wc codelab | PWA orientée données et capacités modernes</title>
      <link rel="icon" type="image/png" href="/favicon.png">
      <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Source+Code+Pro:400|Roboto:400,300,400italic,500,700|Roboto+Mono">
      <link rel="stylesheet" href="https://fonts.googleapis.com/icon?family=Material+Icons">
      <link rel="stylesheet" href="https://storage.googleapis.com/codelab-elements/codelab-elements.css">
      <style>
        .success {
          color: #1e8e3e;
        }
        .error {
          color: red;
        }
        .center {
          text-align: center;
        }
      </style>
    </head>

    <body>
      <google-codelab title="PWA orientée données et capacités modernes" feedback-link="https://github.com/open-wc/open-wc/issues">

        
    <google-codelab-step label="Introduction">

    <p>Durant ce codelab, vous cr&#xE9;erez une application Web progressive disponible hors-ligne, orient&#xE9;e donn&#xE9;es, et dot&#xE9;e de capacit&#xE9;s modernes de pointe.</p><h3 id="sujets-trait&#xE9;s">Sujets trait&#xE9;s</h3><ul>
<li>Comment utiliser la synchronisation en arri&#xE8;re-plan (background sync) pour mettre &#xE0; jour l&apos;application, m&#xEA;me lorsque celle-ci n&apos;est pas affich&#xE9;e.</li>
</ul><h3 id="pr&#xE9;-requis">Pr&#xE9;-requis</h3><p>Ce codelab requiert que vous soyez d&#xE9;j&#xE0; familier avec les &#xE9;l&#xE9;ments de base du d&#xE9;veloppement Web.</p><p>En particulier, il est recommand&#xE9; d&apos;avoir une certaine ma&#xEE;trise d&apos;HTML, de CSS et de JavaScript (i.e. ES2019),
et d&apos;avoir au moins une fois contribu&#xE9; au d&#xE9;veloppement d&apos;une Web App (peu importe le framework ou la librairie utilis&#xE9;).</p><h3 id="important">IMPORTANT</h3><aside class="warning">
  <b>Dans le cas o&#xF9; vous assistiez &#xE0; une version &quot;live&quot; de ce codelab (durant une conf&#xE9;rence, comme le Devfest Paris 2020 par exemple), il vous est fortement recommand&#xE9; d&apos;effectuer les &#xE9;tapes 2 et 3 (installations) en amont !</b>
</aside><h3 id="logiciels-indispensables">Logiciels indispensables</h3><ul>
<li>Un IDE / un &#xE9;diteur de code ou de texte<ul>
<li>recommandation : <a href="https://code.visualstudio.com/">Download Visual Studio Code</a></li>
</ul>
</li>
<li>La derni&#xE8;re version de Chrome<ul>
<li><a href="https://www.google.com/chrome/canary/">Chrome Canary</a></li>
<li>ou <a href="https://www.google.com/chrome/dev/">Chome Dev</a> si vous ne pouvez install la version Canary (eg sur Linux)</li>
<li>(optionnel, en suppl&#xE9;ment) <a href="https://www.mozilla.org/fr/firefox/channel/desktop/#nightly">Firefox</a> Nightly ou Developer Edition</li>
</ul>
</li>
<li><a href="https://nodejs.org/en/">Node.js</a> et <a href="https://www.npmjs.com/">npm</a></li>
</ul><h3 id="recommandations">Recommandations</h3><aside class="notice">
  Ces &#xE9;l&#xE9;ments sont n&#xE9;cessaires pour tester plusieurs fonctionnalit&#xE9;s que vous ajouterez &#xE0; la PWA. Ils ne sont pas absolument indispensables pour compl&#xE9;ter ce codelab, mais tr&#xE8;s fortement recommand&#xE9;s.
</aside><ul>
<li>un syst&#xE8;me Windows ou Mac OS X<ul>
<li>si vous utilisez Linux, vous pourrez au besoin utiliser une <a href="https://developer.microsoft.com/en-us/windows/downloads/virtual-machines/">VM</a>, mais vous devrez &#xE9;galement y installer la derni&#xE8;re version de Chrome (cf. plus haut), et vous assurer que celle-ci peut acc&#xE9;der au syst&#xE8;me h&#xF4;te via un r&#xE9;seau virtuel (HTTP)</li>
</ul>
</li>
<li>un smartphone Android, un cable usb et <a href="https://developer.android.com/studio">Android Studio</a></li>
</ul>

    </google-codelab-step>
  
    <google-codelab-step label="Mise en place">

    <h3 id="projet">Projet</h3><p>Clonez le code de d&#xE9;marrage depuis GitHub via la commande suivante :</p><pre><code class="language-bash">git clone https://github.com/noelmace/data-driven-pwa.git</code></pre><p>Vous pouvez &#xE9;galement le t&#xE9;l&#xE9;charger au format zip <a href="https://github.com/noelmace/data-driven-pwa/archive/master.zip">en cliquant ici</a>.</p><h3 id="d&#xE9;pendances">D&#xE9;pendances</h3><p>Rendez-vous &#xE0; la racine du projet via la commande :</p><pre><code class="language-bash">cd data-driven-pwa</code></pre><p>Installez ensuite les d&#xE9;pendances du projet en lan&#xE7;ant la commande suivante :</p><pre><code class="language-bash">npm install</code></pre><aside class="special">
  Cette commande lance l&apos;installation des outils de d&#xE9;veloppement depuis la racine du d&#xE9;p&#xF4;t, incluant [Lerna](https://lerna.js.org/). Ce dernier est ensuite utilis&#xE9; pour &#xE9;galement installer les d&#xE9;pendances de tous les sous-projets, &#xE0; partir desquels vous effectuerez les &#xE9;tapes suivantes. Par conc&#xE9;quent, <b>il ne vous sera pas n&#xE9;cessaire d&apos;effectuer un `npm install` pour chacun de ces projets</b>.
</aside>

    </google-codelab-step>
  
    <google-codelab-step label="Premier contact avec l'application">

    <p>Via le terminal, rendez-vous dans le dossier &quot;project&quot; o&#xF9; se situent les &#xE9;l&#xE9;ments de base du projet :</p><pre><code class="language-bash">cd project</code></pre><p>&#xC0; partir de ce dossier, d&#xE9;marrez le serveur de d&#xE9;veloppement pour pouvoir utiliser et tester l&apos;application :</p><pre><code class="language-bash">npm run --silent start</code></pre><p>Ouvrez l&apos;application en entrant l&apos;url <a href="http://localhost:8081">localhost:8081</a> dans votre navigateur web.</p><p>L&apos;application vous demande alors une autorisation pour pouvoir afficher des notifications. Cliquez sur &quot;Autoriser&quot; ou &quot;Allow&quot; pour l&apos;accepter.</p><p><img src="https://codelabs.developers.google.com/codelabs/workbox-indexeddb/img/9ca6ac4aededfba6.png" alt="Autoriser les notifications"> <br><em>Cr&#xE9;dit image: &#xA9;&#xFE0F; Google Inc.</em></p><aside class="special">
  Cette application est issue d&apos;un codelab de Google intitul&#xE9; <a href="https://codelabs.developers.google.com/codelabs/workbox-indexeddb/#2" target="_blank" rel="noopener noreferrer"><i>Build an offline-first, data-driven PWA</i></a>.
</aside>

    </google-codelab-step>
  
    <google-codelab-step label="Une application orientée données">

    <p>Retournez &#xE0; la racine du projet, et lancez la commande permettant de modifier automatiquement le code pour ce chapitre :</p><pre><code class="language-bash">cd ..
npm run goto --step=4</code></pre><aside class="special">
  <p>Cette m&#xEA;me commande permet &#xE9;galement de &quot;sauter&quot;/corriger tous les chapitres suivants. Il est cependant indispensable de les lancer avant toute modification du code du projet, dans l&apos;ordre, en commen&#xE7;ant par 4.</p>
</aside><p>&#xC9;tant donn&#xE9; que cette commande modifie, pour cette &#xE9;tape, la configuration de build, vous devez &#xE9;galement stopper (<code>Ctrl+C</code>) le serveur et le relancer :</p><pre><code class="language-bash">cd project
npm run --silent start</code></pre><p>Retournez dans le navigateur, et mettez &#xE0; jour l&apos;application :</p><ol>
<li>Rafra&#xEE;chissez la page dans Chrome (<code>Ctrl+Maj+R</code>)</li>
<li>Ouvrez les Developer Tools (<code>Ctrl+Maj+i</code>)</li>
<li>S&#xE9;lectionnez la section <em>Service Workers</em></li>
<li>Activez le nouveau service worker en cliquant sur <code>skipWaiting</code></li>
<li>Enfin, rafra&#xEE;chissez la page &#xE0; nouveau</li>
</ol><aside class="tip">
  Notez bien ces &#xE9;tapes. Vous devrez les reproduire souvent par la suite.
</aside><p>Enfin, stoppez le serveur pour simuler une coupure r&#xE9;seau, puis rechargez l&apos;application dans le navigateur. Vous constaterez alors que l&apos;application semble fonctionner &#xE0; l&apos;identique.</p><p>Dans les developer tools de Chrome, s&#xE9;lectionnez la section <em>IndexedDB</em>, puis la base de donn&#xE9;e <em>dashboardr</em>. Celle-ci permet de stocker localement les &quot;&#xE9;v&#xE8;nements&quot; pour une consultation hors ligne.</p><p>L&apos;application dont vous disposez &#xE0; pr&#xE9;sent est bien une PWA enti&#xE8;rement disponible hors-ligne !</p><h3 id="explication">Explication</h3><p>Sans d&#xE9;veloppement sp&#xE9;cifique, quand un utilisateur tente d&apos;acc&#xE9;der &#xE0; une Web App en &#xE9;tant d&#xE9;connect&#xE9;, un message &quot;Offline&quot; est affich&#xE9;, emp&#xE9;chant toute utilisation de l&apos;application.</p><p class="center">
  <img src="./assets/firefox-offline.png" alt="firefox is offline" style="margin: 1rem">
</p><p>Workbox a permis, en mettant en cache le App Shell, de ne jamais montrer ce type de message &#xE0; un utilisateur retournant sur l&apos;application.</p><p>Mais une application n&apos;est rien sans donn&#xE9;es !
Nous avons donc utilis&#xE9; IndexDB pour mettre ces donn&#xE9;es en cache (ici, des &quot;events&quot;), et permettre de les consulter m&#xEA;me en &#xE9;tant hors-ligne.</p><p>Un probl&#xE8;me persiste cependant : comme le serveur n&apos;est bien &#xE9;videmment pas disponible quand l&apos;utilisateur est hors ligne, tous les &quot;events&quot; qu&apos;il aura alors cr&#xE9;&#xE9; n&apos;auront &#xE9;t&#xE9; stock&#xE9;s que localement. Ils seront donc perdus tr&#xE8;s rapidement !</p><p>Nous allons dans le chapitre suivant r&#xE9;soudre ce probl&#xE8;me via workbox-background-sync, et donc la Background Sync API.</p><h3 id="pas-&#xE0;-pas-optionnel">Pas-&#xE0;-pas (optionnel)</h3><p>Vous pouvez &#xE9;galement suivre les <a href="https://codelabs.developers.google.com/codelabs/workbox-indexeddb/#3" target="_blank" rel="noopener noreferrer">&#xE9;tapes 4 &#xE0; 7 du codelab Google</a> pour mieux comprendre en d&#xE9;tails ces fonctionnalit&#xE9;s.</p><p>Pour gagner du temps, les &quot;step&quot; correspondant ont &#xE9;t&#xE9; cr&#xE9;&#xE9;s pour la commande &quot;goto&quot;. Leurs num&#xE9;ros suivent le format <code>4-&lt;step google&gt;</code> :</p><pre><code class="language-bash">npm run goto --step=4-4
npm run goto --step=4-5
npm run goto --step=4-6
npm run goto --step=4-7</code></pre><aside class="warning">
  Si vous d&#xE9;cidez d&apos;&#xE9;crire ce code vous m&#xEA;me, assurez vous d&apos;utiliser la derni&#xE8;re version de Workbox (5.0.0) au lieu de celle indiqu&#xE9;e dans le premier code d&apos;exemple (3.5.0).
</aside><pre><code class="language-javascript">importScripts(&apos;https://storage.googleapis.com/workbox-cdn/releases/5.0.0/workbox-sw.js&apos;);</code></pre>

    </google-codelab-step>
  
    <google-codelab-step label="Ne pas perdre de données hors-ligne">

    <h3 id="compatibilit&#xE9;-des-navigateurs">Compatibilit&#xE9; des navigateurs</h3><p>La <a href="https://wicg.github.io/BackgroundSync/spec/">BackgroundSync API</a> est toujours &#xE0; ce jour &#xE0; l&apos;&#xE9;tat de Draft.
Par cons&#xE9;quent, m&#xEA;me si <a href="https://groups.google.com/forum/#!msg/mozilla.dev.platform/cTAnBeZFtUE/kx0I4UC-AQAJ">Firefox souhaite l&apos;impl&#xE9;menter depuis longtemps</a>, celle-ci n&apos;est pour l&apos;heure support&#xE9;e que par <a href="https://www.chromestatus.com/feature/6170807885627392">Chrome</a> et <a href="https://developer.mozilla.org/en-US/docs/Web/API/ServiceWorkerRegistration/sync#Browser_compatibility">Opera</a>.</p><p>Fort heureusement, nous allons impl&#xE9;menter cette fonctionnalit&#xE9; via Workbox, qui int&#xE8;gre une <a href="https://developers.google.com/web/tools/workbox/modules/workbox-background-sync#adding_a_request_to_the_queue">strat&#xE9;gie de fallback</a> :
&#xE0; chaque fois que le service worker sera &#xE0; nouveau d&#xE9;marr&#xE9;, celui-ci rejouera tous les appels qui n&apos;ont pu aboutir jusque l&#xE0;, et ont donc &#xE9;t&#xE9; mis en attente.</p><p>Cela est bien entendu moins efficace (car l&apos;application doit &#xEA;tre active pour se faire), mais r&#xE9;sout la plupart des probl&#xE8;mes de compatibilit&#xE9;.</p><h3 id="mise-en-place-du-background-sync">Mise en place du Background Sync</h3><p>Ajoutez le code suivant dans <strong>app/sw.js</strong> juste en dessous de <code>precacheAndRoute</code> :</p><pre><code class="language-javascript">const { BackgroundSyncPlugin } = workbox.backgroundSync;
const { registerRoute } = workbox.routing;
const { NetworkOnly } = workbox.strategies;

const bgSyncPlugin = new BackgroundSyncPlugin(&apos;dashboardr-queue&apos;);

const networkWithBackgroundSync = new NetworkOnly({
  plugins: [bgSyncPlugin]
});

registerRoute(/\/api\/add/, networkWithBackgroundSync, &apos;POST&apos;);</code></pre><p>Enregistrez le fichier, et relancez le serveur :</p><pre><code class="language-bash">npm run --silent start</code></pre><h3 id="tester-lapplication">Tester l&apos;application</h3><p>Pour voir le r&#xE9;sultat de cette nouvelle fonctionnalit&#xE9;, effectuez une nouvelle mise &#xE0; jour de l&apos;application (refresh - skipWaiting - refresh) et stopper le serveur.</p><p>D&#xE9;connectez votre ordinateur du r&#xE9;seau <strong>pour de vrais</strong> (wifi et cable).</p><aside class="warning">
  Le background sync se basant sur le <i>v&#xE9;ritable</i> statut de la connection r&#xE9;seau de votre syst&#xE8;me, il est indispensable d&apos;activer et d&#xE9;sactiver votre ordinateur pour ce chapitre et le suivant. <b>Le trottling via les DevTools et l&apos;arr&#xEA;t de serveur ne suffiront pas.</b>
</aside><p>Dans <code>Developer Tools &gt; Background Sync</code>, d&#xE9;marrez la capture des &#xE9;v&#xE8;nements Background Sync.</p><p><img src="./assets/record-bgsync.png" alt="capture: record bgsync in Chrome"></p><p>Cr&#xE9;er un nouvel &apos;event&apos; via le formulaire en bas de l&apos;application.</p><p>En allant &#xE0; l&apos;onglet &apos;Network&apos; des devtools, vous pourrez constater qu&apos;une requ&#xEA;te vers <code>/api/add</code> a &#xE9;chou&#xE9;e.</p><p><img src="./assets/5-failed-request.png" alt="capture: request failed"></p><p>Dans le m&#xEA;me temps, une nouvelle base <code>workbox-background-sync</code> a &#xE9;t&#xE9; cr&#xE9;&#xE9;e, contenant une request vers <code>http://localhost:8081/api/add</code> (<code>requestData.url</code>) (cf. <code>Developer Tools &gt; Application &gt; IndexedDB</code>) et un &#xE9;v&#xE8;nement &quot;Registered Sync&quot; est visible dans &quot;Background Sync&quot;.</p><aside class="notice">
  Pensez &#xE0; rafra&#xEE;chir IndexedDB (click droit) si rien n&apos;appara&#xEE;t.
</aside><p>Enfin, il est temps de repasser en ligne :</p><ol>
<li>Relancez le serveur</li>
</ol><pre><code class="language-bash">npm run --silent start</code></pre><ol start="2">
<li>Une fois le serveur pleinement disponible, r&#xE9;tablissez la connexion de votre machine.</li>
</ol><p>De nouveaux &#xE9;v&#xE8;nements Background Sync sont &#xE0; pr&#xE9;sent visible dans les devtools.</p><p><img src="./assets/bgsync-events.png" alt="capture: bgsync events"></p><p>Cela a permis &#xE0; votre service worker de retenter l&apos;appel &#xE0; <code>/api/add</code>, avec succ&#xE8;s cette fois, comme indiqu&#xE9; dans &quot;Networks&quot;.</p><p>Bien entendu, la requ&#xEA;te &#xE0; du m&#xEA;me coup &#xE9;t&#xE9; supprim&#xE9;e de la base IndexedDB.</p><p>Enfin, rechargez la page : vous constaterez que votre nouvel &#xE9;v&#xE8;nement a bien &#xE9;t&#xE9; enregistr&#xE9;, et est donc toujours pr&#xE9;sent.</p><aside class="special">
  Vos nouveaux &#xE9;v&#xE8;nements ont m&#xEA;me &#xE9;t&#xE9; enregistr&#xE9;s par le serveur dans <code>server-data/events.json</code>.
</aside><aside class="warning">
  Le background sync sous Chrome <a href="https://github.com/GoogleChrome/workbox/issues/1896">peut parfois &#xEA;tre capricieux</a>. Si un &quot;Registered Sync&quot; n&apos;apparait pas apr&#xE8;s que vous ayez cr&#xE9;&#xE9; votre &#xE9;v&#xE8;nement, il s&apos;agit sans doute d&apos;un bug ind&#xE9;pendant de l&apos;application. Fermez compl&#xE8;tement Chrome (y compris les processus en arri&#xE8;re plan), red&#xE9;marrez le, et retentez l&apos;op&#xE9;ration apr&#xE8;s avoir supprim&#xE9; toutes les donn&#xE9;es de l&apos;application (Clear Storage &gt; Clear site data).
</aside>

    </google-codelab-step>
  
    <google-codelab-step label="Informer l'utilisateur de l'enregistement">

    <p>La potentialit&#xE9; d&apos;une perte de donn&#xE9;es est toujours source de stress pour vos utilisateurs. <em>Votre serviteur en sait quelque chose, &#xE9;tant donn&#xE9; qu&apos;il &#xE9;crit actuellement ce chapitre pour la seconde fois, suite &#xE0; un git checkout malencontreux &#x1F613;. Ironique n&apos;est-ce pas ?</em></p><p>C&apos;est pourquoi il est indispensable de prendre en compte l&apos;int&#xE9;gralit&#xE9; de leur parcours, de la cr&#xE9;ation de donn&#xE9;es hors ligne (et donc, leur stockage localement) &#xE0; l&apos;enregistrement de celles ci c&#xF4;t&#xE9; serveur une fois la connexion retrouv&#xE9;e.</p><aside class="warning">
  Notez bien que sans l&apos;usage des outils de d&#xE9;veloppement et l&apos;acc&#xE8;s au serveur, vous auriez &#xE9;t&#xE9; bien incapable de dire, &#xE0; l&apos;&#xE9;tape pr&#xE9;c&#xE9;dente, si vos &#xE9;v&#xE8;nements avaient bien &#xE9;t&#xE9; enregistr&#xE9;s.
</aside><p>Ici, notre application est plut&#xF4;t sommaire. Nous nous contenterons donc d&apos;informer l&apos;utisateur de l&apos;enregistrement de ces donn&#xE9;es via une notification.</p><h3 id="afficher-une-notification">Afficher une notification</h3><p>Ajoutez le code suivant &#xE0; <strong>app/sw.js</strong> :</p><pre><code class="language-javascript">const showNotification = () =&gt; {
  self.registration.showNotification(&apos;Background sync success!&apos;, {
    body: &apos;&#x1F389;`&#x1F389;`&#x1F389;`&apos;
  });
};</code></pre><p>Comme son nom l&apos;indique, cette fonction fait usage de la Notification API pour afficher une notification &quot;syst&#xE8;me&quot;. Rien de plus.</p><p>Pour y faire appel &#xE0; la reception d&apos;un sync event, ajoutez une option <code>onSync</code> &#xE0; notre BackgroundSyncPlugin, comme suit :</p><pre><code class="language-javascript">const bgSyncPlugin = new BackgroundSyncPlugin(&apos;dashboardr-queue&apos;, {
  onSync: showNotification
});</code></pre><h3 id="tester-lapplication-1">Tester l&apos;application</h3><p>R&#xE9;p&#xE9;tez maintenant les m&#xEA;mes op&#xE9;rations qu&apos;&#xE0; l&apos;&#xE9;tape pr&#xE9;c&#xE9;dente. Rechargez l&apos;application, activez le service worker via un skipInstall, rechargez &#xE0; nouveau, puis passez hors (en coupant le serveur et la connection r&#xE9;seau de votre machine). Vous pouvez &#xE0; pr&#xE9;sent cr&#xE9;er un nouvel &#xE9;v&#xE8;nement.</p><p>R&#xE9;activez votre connection (serveur, puis machine). Vous verrez alors appara&#xEE;tre la notification.</p><p>Mais il semblerait que nous ayons cr&#xE9;&#xE9; une notification trompeuse. Votre &#xE9;v&#xE8;nement n&apos;a pas &#xE9;t&#xE9; enregistr&#xE9; ! Explorez les devtools pour vous en assurer.</p><h3 id="explication-1">Explication</h3><p>Par d&#xE9;faut, un BackgroundSyncPlugin a un comportement des plus simple. Il cr&#xE9;&#xE9; un file (queue) par d&#xE9;faut, stocke toutes les appels correspondant &#xE0; la route &#xE0; laquelle il a &#xE9;t&#xE9; associ&#xE9; dans celle-ci quand ils &#xE9;chouent, et les rejouent tous &#xE0; la reception d&apos;un sync event.</p><p>Mais l&apos;option <code>onSync</code> n&apos;a pas vocation &#xE0; n&apos;&#xEA;tre qu&apos;une simple callback en adition de ce comportement. Elle le remplace.</p><p>Ainsi, quand nous avons associ&#xE9; <code>showNotification</code> au <code>onSync</code> du plugin, nous n&apos;avons pas ajout&#xE9; un comportement.
Nous l&apos;avons remplac&#xE9;.</p><h3 id="customiser-le-comportement-de-workbox">Customiser le comportement de Workbox</h3><p>Pour r&#xE9;parer cette erreur, nous devons reproduire le comportement par d&#xE9;faut du plugin, et donc rejouer tous les appels dans sa file.</p><p>Editez <code>showNotification</code> pour obtenir le r&#xE9;sultat suivant :</p><pre><code class="language-javascript">const showNotification = ({ queue }) =&gt; {
  queue.replayRequests();
  self.registration.showNotification(&apos;Background sync success!&apos;, {
    body: &apos;&#x1F389;`&#x1F389;`&#x1F389;`&apos;
  });
};</code></pre><p>Enfin, r&#xE9;-effectuez le test de l&apos;application pr&#xE9;c&#xE9;dent, et gardez un &#x153;il sur la console et &quot;Network&quot;. Votre appel POST sur /api/add sera cette fois-ci rejou&#xE9; correctement une fois la connexion retrouv&#xE9;e, et votre &#xE9;v&#xE8;nement bien enregistr&#xE9;.</p>

    </google-codelab-step>
  

      </google-codelab>

      <script src="https://storage.googleapis.com/codelab-elements/native-shim.js"></script>
      <script src="https://storage.googleapis.com/codelab-elements/custom-elements.min.js"></script>
      <script src="https://storage.googleapis.com/codelab-elements/prettify.js"></script>
      <script src="https://storage.googleapis.com/codelab-elements/codelab-elements.js"></script>

    </body>
    </html>
  